{
  "backend/main.mo": "Main Motoko canister handling access control, user profiles, deposit intents, and submissions with authorization checks.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files in the project.",
  "frontend/index.css": "Tailwind CSS config defining theme variables and base styles for light and dark modes.",
  "frontend/index.html": "Root HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining public, auth, user, and admin routes with layouts and guards.",
  "frontend/src/components/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout with sidebar, header, and routed content area.",
  "frontend/src/components/layouts/PublicLayout.tsx": "Public-facing layout with header, footer, and main routed content area.",
  "frontend/src/components/layouts/UserDashboardLayout.tsx": "User dashboard layout with sidebar, header, and routed content area.",
  "frontend/src/components/nav/AdminSidebar.tsx": "Admin sidebar navigation listing dashboard, deposits, users, announcements, and settings.",
  "frontend/src/components/nav/DashboardHeader.tsx": "Header with sidebar trigger and logout button that clears identity, resets queries, and redirects to login.",
  "frontend/src/components/nav/PublicFooter.tsx": "Public footer showing copyright, branding, and a referral link to caffeine.ai.",
  "frontend/src/components/nav/PublicHeader.tsx": "Public navigation bar with logo, main links, and a mobile menu toggle.",
  "frontend/src/components/nav/UserSidebar.tsx": "Sidebar for authenticated users providing navigation to dashboard, token pages, and referral sections.",
  "frontend/src/components/screens/AccessDeniedScreen.tsx": "Screen displayed when access is denied, offering navigation back to login or home.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on identity and refreshes related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook handling identity loading, login, logout, and status management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profile, presale data, deposits, and admin/user-related actor calls.",
  "frontend/src/hooks/useSession.ts": "Hook combining identity, actor, role, and user profile queries to expose session and authorization state.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining VCoin brand colors and theme settings.",
  "frontend/src/main.tsx": "App bootstrap that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminHome.tsx": "Displays admin dashboard metrics using fetched user data and placeholders for token and deposit stats.",
  "frontend/src/pages/admin/AdminSettings.tsx": "Provides UI sections for presale, wallet, and vesting settings, currently with placeholder content.",
  "frontend/src/pages/admin/Announcements.tsx": "Shows an announcements management page with a placeholder list of active announcements.",
  "frontend/src/pages/admin/DepositsQueue.tsx": "Renders the admin view for pending deposit approvals with a placeholder empty state.",
  "frontend/src/pages/admin/UsersManagement.tsx": "Fetches and displays a table of all registered users with loading and empty states.",
  "frontend/src/pages/auth/Login.tsx": "Handles Internet Identity login and redirects users based on authentication and admin status.",
  "frontend/src/pages/auth/Register.tsx": "Guides new users through II authentication and profile creation, then saves the profile and redirects.",
  "frontend/src/pages/public/Home.tsx": "Landing page showcasing VCoin features, hero section, and links to register or read the whitepaper.",
  "frontend/src/pages/public/Roadmap.tsx": "Displays the VCoin roadmap from 2025–2030 with yearly milestone lists.",
  "frontend/src/pages/public/SmartContractArchitecture.tsx": "Displays planned VCoin smart contract components and explains current off-chain presale management.",
  "frontend/src/pages/public/Whitepaper.tsx": "Renders VCoin whitepaper sections including project intro, tokenomics, referral model, and vesting logic.",
  "frontend/src/pages/user/BuyVCoin.tsx": "Provides UI to calculate VCN purchases, create deposit intents, and show current presale stage data.",
  "frontend/src/pages/user/DepositHistory.tsx": "Shows user deposit submissions with status indicators and parsed transaction details.",
  "frontend/src/pages/user/ReferralEarnings.tsx": "Displays user's referral code, allows copying links, and outlines the referral reward structure.",
  "frontend/src/pages/user/ReferralNetworkTree.tsx": "Shows a referral network placeholder UI with messaging for users without referrals yet.",
  "frontend/src/pages/user/TokenBalance.tsx": "Displays locked, unlocked, and total VCN balances with notes on vesting and 2027 unlock.",
  "frontend/src/pages/user/UserHome.tsx": "Renders the user dashboard with links to buy tokens, view balance, referrals, and shows the user's referral code with copy functionality.",
  "frontend/src/pages/user/VestingProgress.tsx": "Displays vesting status and schedule, showing pre-launch info until the configured launch year and post-launch unlock details afterward.",
  "frontend/src/routes/routeGuards.tsx": "Provides user and admin route guards that redirect unauthenticated users, block non-admins, and enforce admin password-change requirements.",
  "frontend/src/utils/fingerprint.ts": "Generates and stores a simple browser fingerprint using user-agent, locale, screen info, and timezone.",
  "frontend/src/utils/urlParams.ts": "Utility functions to get, persist, and clear URL parameters, including hash-based routing support and sessionStorage fallback.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's current state, requirements, architecture notes, known issues, and image needs for the VCoin web app."
}