{
  "backend/main.mo": "Motoko canister defining user profiles, access control, and deposit intent/submission storage with authorization checks and utility helpers.",
  "feature_evidence.json": "Feature evidence report listing required frontend routing fixes and global error fallback additions with associated files and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles in routing, layouts, session handling, and UI screens.",
  "frontend/index.css": "Tailwind CSS setup defining global design tokens, theming variables, and base styling for light and dark modes.",
  "frontend/index.html": "Base HTML document providing the root container and loading the main React entrypoint.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and layouts with ThemeProvider, Outlet rendering, and error boundary wrapping.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches render errors and displays a simple fallback screen.",
  "frontend/src/components/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout with sidebar, header, and routed content area using Outlet.",
  "frontend/src/components/layouts/PublicLayout.tsx": "Public site layout with header, footer, and routed content rendered via Outlet.",
  "frontend/src/components/layouts/UserDashboardLayout.tsx": "User dashboard layout with sidebar, header, and main routed content area using Outlet.",
  "frontend/src/components/nav/AdminSidebar.tsx": "Admin sidebar navigation listing dashboard, deposits, users, announcements, and settings links.",
  "frontend/src/components/nav/DashboardHeader.tsx": "Dashboard header with sidebar trigger and logout logic that clears session and redirects to login.",
  "frontend/src/components/nav/PublicFooter.tsx": "Renders the public footer with branding, current year, and a referral link to caffeine.ai.",
  "frontend/src/components/nav/PublicHeader.tsx": "Displays the public navigation header with links, logo, and a mobile-responsive menu.",
  "frontend/src/components/nav/UserSidebar.tsx": "Provides the authenticated user sidebar with grouped navigation links for dashboard, tokens, and referrals.",
  "frontend/src/components/screens/AccessDeniedScreen.tsx": "Shows an access denied message with options to go to login or return home.",
  "frontend/src/components/screens/AppErrorFallback.tsx": "Displays a generic error screen with a reload button for unrecoverable app errors.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identities, and auth client initialization.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profile, presale data, deposits, and user lists.",
  "frontend/src/hooks/useSession.ts": "Combines identity, actor, and user queries to expose authentication state, profile, and role info.",
  "frontend/src/index.css": "Defines Tailwind base styles and VCoin theme colors for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminHome.tsx": "Displays admin dashboard metrics using user data and placeholder values for presale stats.",
  "frontend/src/pages/admin/AdminSettings.tsx": "Provides UI sections for modifying presale settings, wallet address, and vesting, with features not yet implemented.",
  "frontend/src/pages/admin/Announcements.tsx": "Shows a management page for admin announcements with a placeholder for active items.",
  "frontend/src/pages/admin/DepositsQueue.tsx": "Renders an admin view for reviewing pending deposits, currently showing an empty state.",
  "frontend/src/pages/admin/UsersManagement.tsx": "Fetches and displays all registered users in a table with loading and empty states.",
  "frontend/src/pages/auth/Login.tsx": "Handles Internet Identity login and redirects users or admins to their respective dashboards.",
  "frontend/src/pages/auth/Register.tsx": "Manages registration flow using Internet Identity and submits a new user profile after login.",
  "frontend/src/pages/public/Home.tsx": "Public landing page with hero section, features overview, and links to registration and whitepaper.",
  "frontend/src/pages/public/Roadmap.tsx": "Static roadmap page outlining VCoin development milestones from 2025 to 2030.",
  "frontend/src/pages/public/SmartContractArchitecture.tsx": "Displays planned smart contract components for VCoin and explains current off-chain presale management.",
  "frontend/src/pages/public/Whitepaper.tsx": "Renders the VCoin whitepaper with project intro, vision, tokenomics, referral model, and vesting details.",
  "frontend/src/pages/user/BuyVCoin.tsx": "Provides UI for calculating VCN purchases, copying wallet address, and creating presale deposit intents.",
  "frontend/src/pages/user/DepositHistory.tsx": "Shows the user's deposit submissions with status, parsed from stored JSON entries.",
  "frontend/src/pages/user/ReferralEarnings.tsx": "Displays referral code, sharing tools, reward structure, and current referral earnings.",
  "frontend/src/pages/user/ReferralNetworkTree.tsx": "Shows a placeholder network tree view with referral instructions when no referrals exist.",
  "frontend/src/pages/user/TokenBalance.tsx": "Displays total, locked, and unlocked VCN balances with a notice about vesting until 2027.",
  "frontend/src/pages/user/UserHome.tsx": "User dashboard showing welcome text, quick links for buying tokens, viewing balances, referrals, and a referral code copy feature.",
  "frontend/src/pages/user/VestingProgress.tsx": "Displays vesting status, showing a pre-launch notice or active vesting details based on the current year.",
  "frontend/src/routes/routeGuards.tsx": "Provides UserGuard and AdminGuard components that enforce authentication, admin role checks, and optional forced admin password change.",
  "frontend/src/utils/fingerprint.ts": "Generates and stores a persistent browser fingerprint using basic environment properties.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters with sessionStorage fallbacks and hash support.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, colors, animations, and plugins for app-wide styling.",
  "project_state.json": "Project metadata describing VCoin’s Web2 presale system, architecture notes, known issues, and existing feature definitions."
}