{
  "backend/main.mo": "Canister implementing access‑controlled user profiles plus deposit intent and submission storage with related CRUD methods.",
  "feature_evidence.json": "JSON metadata listing feature reports, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Reference map of frontend file paths to short descriptive summaries for build and planning use.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode values, and global base styles.",
  "frontend/index.html": "Base HTML entry point mounting the root element and loading the main React script.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, layouts, guards, and global theme/toast providers.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that captures unhandled errors and displays a fallback screen.",
  "frontend/src/components/layouts/AdminDashboardLayout.tsx": "Admin dashboard layout with sidebar, header, and routed main content area.",
  "frontend/src/components/layouts/PublicLayout.tsx": "Public site layout with header, footer, routed content, and an Internet Identity init‑error banner.",
  "frontend/src/components/layouts/UserDashboardLayout.tsx": "User dashboard layout containing sidebar navigation, header, and main outlet.",
  "frontend/src/components/nav/AdminSidebar.tsx": "Admin sidebar navigation with links to dashboard, deposits, users, announcements, and settings.",
  "frontend/src/components/nav/DashboardHeader.tsx": "Header with sidebar trigger and logout button that clears identity, cache, and navigates to login.",
  "frontend/src/components/nav/PublicFooter.tsx": "Public footer showing copyright, branding, and a referral link to caffeine.ai.",
  "frontend/src/components/nav/PublicHeader.tsx": "Public site header with logo, navigation links, and a responsive mobile menu.",
  "frontend/src/components/nav/UserSidebar.tsx": "Sidebar navigation for authenticated users with links to dashboard, tokens, and referral sections.",
  "frontend/src/components/screens/AccessDeniedScreen.tsx": "Full-page screen informing the user of access denial with buttons to log in or return home.",
  "frontend/src/components/screens/AppErrorFallback.tsx": "Fallback error screen prompting users to reload the page after an unexpected error.",
  "frontend/src/components/screens/InitErrorScreen.tsx": "Screen shown when initialization fails, offering a page reload option.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, identity loading, and status management using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of hooks wrapping actor calls for profiles, presale data, deposits, and user lists with react-query.",
  "frontend/src/hooks/useSession.ts": "Hook combining identity, actor, and profile/role queries to expose session state and auth helpers.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for theming, including dark mode and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, rendering the main App component.",
  "frontend/src/pages/admin/AdminHome.tsx": "Shows the admin dashboard with user metrics placeholders and presale stage info.",
  "frontend/src/pages/admin/AdminSettings.tsx": "Provides admin settings layout with placeholder sections for presale, wallet, and vesting configuration.",
  "frontend/src/pages/admin/Announcements.tsx": "Renders an admin announcements page with a placeholder list indicating no announcements exist yet.",
  "frontend/src/pages/admin/DepositsQueue.tsx": "Displays the deposits queue page showing pending deposits, currently with a placeholder message.",
  "frontend/src/pages/admin/UsersManagement.tsx": "Fetches and displays a table of all registered users or a loading/empty state.",
  "frontend/src/pages/auth/Login.tsx": "Handles Internet Identity login and redirects users based on session state, with UI for login errors.",
  "frontend/src/pages/auth/Register.tsx": "Manages user registration flow, including identity login, profile creation, validation, and saving.",
  "frontend/src/pages/NotFound.tsx": "Displays a styled 404 page with a button linking back to the home page.",
  "frontend/src/pages/public/Home.tsx": "Landing page with hero, features, and presale promotion components for VCoin.",
  "frontend/src/pages/public/Roadmap.tsx": "Displays VCoin’s roadmap from 2025–2030 using card-based milestone sections.",
  "frontend/src/pages/public/SmartContractArchitecture.tsx": "Explains planned smart contract components and current off‑chain presale architecture.",
  "frontend/src/pages/public/Whitepaper.tsx": "Renders a structured whitepaper covering VCoin’s intro, tokenomics, vision, and reward model.",
  "frontend/src/pages/user/BuyVCoin.tsx": "User interface for calculating VCN purchases, viewing presale stage data, and creating deposit intents.",
  "frontend/src/pages/user/DepositHistory.tsx": "Shows a user’s parsed deposit submissions with status indicators and transaction details.",
  "frontend/src/pages/user/ReferralEarnings.tsx": "Displays the user's referral code, allows copying code/link, and shows referral reward tiers and total earnings.",
  "frontend/src/pages/user/ReferralNetworkTree.tsx": "Shows an empty-state view for the user's multi-level referral network with explanatory alert.",
  "frontend/src/pages/user/TokenBalance.tsx": "Displays locked, unlocked, and total VCN balances with a warning about token lock until 2027.",
  "frontend/src/pages/user/UserHome.tsx": "User dashboard showing quick links to buy tokens, view balance, manage referrals, and copy referral code.",
  "frontend/src/pages/user/VestingProgress.tsx": "Shows vesting info and pre/post-launch messaging, with a placeholder schedule until the 2027 launch.",
  "frontend/src/routes/routeGuards.tsx": "Provides User and Admin route guards handling auth checks, redirects, errors, and admin password-change enforcement.",
  "frontend/src/utils/assetUrl.ts": "Generates environment-safe asset URLs using dev root or Vite’s BASE_URL for production.",
  "frontend/src/utils/fingerprint.ts": "Creates and stores a simple client fingerprint using browser attributes and base64 encoding.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters via query, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, containers, and enabling typography, container queries, and animations plugins.",
  "project_state.json": "Stores the project’s versioned state, architectural notes, known issues with deployment, and a list of implemented features. Marks the current update as a fix request for a previously failing build."
}