{
  "kind": "build_request",
  "title": "Fix deployed preview still showing a blank screen (ensure visible Home page at /)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Investigate and fix the deployed preview rendering a completely blank page so that the public Home page content is visible at the root path `/` (including on mobile browsers).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Abhi bhi wahi pura blank hi dikh rha h"
        ]
      },
      "acceptanceCriteria": [
        "When opening the deployed preview at `/`, the Public Home page renders visible content (hero section, header, etc.) instead of a blank/black screen.",
        "The fix works on mobile browsers as well as desktop.",
        "If an unexpected runtime error occurs during startup, the user sees an English error fallback screen (not a blank page)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Make the app deployment/base-path safe so route matching and static assets load correctly when hosted under a non-root subpath (e.g., preview URLs), including fixing base-URL handling in the HTML entry and router initialization if needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Abhi bhi wahi pura blank hi dikh rha h"
        ]
      },
      "acceptanceCriteria": [
        "In production/deployed preview, the HTML entry point references the favicon and the main script in a way that works under non-root base paths (no broken asset/script URLs).",
        "TanStack Router correctly matches `/` to the public Home route in the deployed preview environment (no blank screen due to route mismatch).",
        "Static generated assets referenced via `assetUrl(...)` (e.g., `assets/generated/vcoin-hero-bg.dim_1920x1080.png` and `assets/generated/vcoin-logo.dim_512x512.png`) load successfully in deployed preview (no missing-image failures that prevent rendering)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Add a guaranteed, user-visible English startup status state so the UI never appears completely blank while the app is initializing or if routing cannot render for any reason (without exposing sensitive technical details).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Abhi bhi wahi pura blank hi dikh rha h"
        ]
      },
      "acceptanceCriteria": [
        "If the app is initializing (before routes render), a visible full-page loading or status UI is shown.",
        "If startup fails in a way not caught by existing guards, a visible English error UI with a 'Reload' action is shown instead of a blank screen.",
        "No sensitive details (stack traces, internal IDs) are displayed to end users in these states."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutable paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui/*`.",
    "Keep all user-facing text in English.",
    "Backend must remain a single Motoko actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Adding new product features unrelated to fixing the blank screen issue.",
    "Introducing third-party auth providers or external hosting/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}