{
  "kind": "build_request",
  "title": "Fix blank page by correcting TanStack Router root route setup and add safe fallback rendering",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Fix the TanStack Router configuration in `frontend/src/App.tsx` so the app renders routes instead of a blank screen. Specifically: do not render a `RouterProvider` inside the `createRootRoute` component (it references `router` before initialization and also nests a second RouterProvider). The root route component must render the routed content (e.g., via the router's Outlet pattern) and keep global wrappers like `ThemeProvider` and `Toaster` around it, while `RouterProvider` is rendered only once (in `App`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Kuch show ni ho rha h bs blank dikh rhe h"
        ]
      },
      "acceptanceCriteria": [
        "Opening the deployed site renders the public home page content instead of a blank screen.",
        "The browser console does not show a runtime error related to accessing `router` before initialization or having nested `RouterProvider` components.",
        "Navigation between public routes (e.g., `/`, `/whitepaper`, `/roadmap`) works and updates the rendered page content."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add an application-level user-friendly error fallback for unexpected client runtime failures during app initialization/render (so users do not see a blank screen). The fallback must display a simple English message and a basic recovery action (e.g., reload page), and it must not leak sensitive details.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Kuch show ni ho rha h bs blank dikh rhe h"
        ]
      },
      "acceptanceCriteria": [
        "If a runtime error is thrown during initial render, the UI shows an English error fallback screen instead of rendering nothing.",
        "The fallback screen provides a visible action to recover (at minimum, a “Reload” button that refreshes the page).",
        "In normal operation (no error), the fallback does not appear and the app behaves as before."
      ]
    }
  ],
  "constraints": [
    "Frontend files under `frontend/src/components/ui` and the immutable hook paths listed in SYSTEM_CONTEXT must not be edited.",
    "Keep backend architecture unchanged (single Motoko actor); this request is strictly about the frontend blank screen rendering issue."
  ],
  "nonGoals": [
    "Implementing new presale/admin/user features beyond fixing the blank render issue.",
    "Changing authentication behavior or role-based access control logic (unless required to resolve the blank screen symptom)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}