{
  "kind": "build_request",
  "title": "Fix deployed preview showing blank/black screen on mobile",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Investigate and fix the deployed preview rendering as a blank/black screen (as shown in the uploaded screenshot) so that the public Home page content is visible at `/` on mobile browsers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Preview me bs asa dikh rha h"
        ]
      },
      "acceptanceCriteria": [
        "Opening the deployed preview URL on a mobile browser renders the Public Header and Home hero section (logo, headline, buttons) instead of a blank/black screen.",
        "No infinite loading state occurs on the public routes (`/`, `/whitepaper`, `/smart-contract`, `/roadmap`).",
        "Any runtime error during initial render results in a visible error UI (not a blank screen)."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Harden TanStack Router initialization so route matching works correctly in the deployed environment, including when hosted under a non-root base path, and add a user-friendly Not Found route for unmatched paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Preview me bs asa dikh rha h"
        ]
      },
      "acceptanceCriteria": [
        "Navigating directly to `/`, `/login`, `/register`, `/user`, and `/admin` works via browser refresh in the deployed preview (no blank screen).",
        "If a user navigates to an unknown route, a Not Found screen is rendered with clear English text and a link back to Home.",
        "Router initialization does not throw (and does not depend on undeclared globals) in production builds."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Ensure app-level failures are always surfaced to users: if Internet Identity initialization fails or an unexpected error occurs before protected routes can resolve, display a visible English error state with a recovery action (e.g., reload).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Preview me bs asa dikh rha h"
        ]
      },
      "acceptanceCriteria": [
        "If Internet Identity initialization fails, the user sees a visible error message and a reload button instead of a blank screen.",
        "If protected routes are loading authentication/actor state, a visible loading UI is shown; it must not get stuck indefinitely without showing either the destination page or an error message.",
        "All user-facing error text is in English and does not leak stack traces or sensitive details."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable hook paths: frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain single-actor in backend/main.mo; do not introduce additional canisters/services."
  ],
  "nonGoals": [
    "Do not add new presale/business features (wallets, new pages, new admin tools) as part of this fix.",
    "Do not change branding/theme/colors except as needed to resolve visibility/rendering issues.",
    "Do not introduce third-party auth providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}