{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "VCoin Presale Frontend: Public Site + User/Admin Dashboards",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create the core Web2-style app shell with public site plus protected User Panel and Admin Panel UIs backed by canister data fetches.",
      "acceptanceCriteria": [
        "Users can register/login and access a user dashboard with sidebar navigation.",
        "Admins can login and access an admin dashboard with sidebar navigation.",
        "All core entities (users, deposits, presale stage config, wallet address config, token balances, referral rewards) persist in the backend canister and survive page refreshes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the application root with routing for public pages, user dashboard routes, and admin dashboard routes; wire route-level guards so protected areas are not accessible without authentication/role checks."
        },
        {
          "path": "frontend/src/routes/routeGuards.tsx",
          "operation": "create",
          "description": "Add reusable route guards for authenticated user-only pages and admin-only pages using backend role checks (e.g., getCallerUserRole / isCallerAdmin) and show an access denied screen when blocked."
        },
        {
          "path": "frontend/src/components/layouts/UserDashboardLayout.tsx",
          "operation": "create",
          "description": "Create a user dashboard layout with a consistent header + collapsible sidebar navigation and a content outlet; keep styling consistent with the global theme."
        },
        {
          "path": "frontend/src/components/layouts/AdminDashboardLayout.tsx",
          "operation": "create",
          "description": "Create an admin dashboard layout with a consistent header + collapsible sidebar navigation and a content outlet; keep styling consistent with the global theme."
        },
        {
          "path": "frontend/src/components/screens/AccessDeniedScreen.tsx",
          "operation": "create",
          "description": "Add an AccessDenied UI for unauthorized access attempts (role blocked / not logged in) with clear English messaging and a call-to-action to login or return to public pages."
        },
        {
          "path": "frontend/src/components/nav/PublicHeader.tsx",
          "operation": "create",
          "description": "Create a public header/navigation that links to required public informational pages and to the auth entry to access dashboards; keep consistent styling across the site."
        },
        {
          "path": "frontend/src/hooks/useSession.ts",
          "operation": "create",
          "description": "Create a small session helper hook that composes Internet Identity state + backend role/profile queries for consistent app-wide session state (authenticated, role, profile readiness). Verify the authorization component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement frontend authentication UX and role-based navigation/guards including first-login admin password change enforcement UI.",
      "acceptanceCriteria": [
        "User endpoints reject requests that try to read/modify other users’ records.",
        "Admin-only endpoints reject non-admin callers.",
        "Admin can change password from an Admin Settings screen; first-login password change is enforced before accessing other admin pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/auth/Login.tsx",
          "operation": "create",
          "description": "Build a login screen that uses the selected authorization system for authentication state and then routes the user to the correct area based on role (user vs admin). Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminSettings.tsx",
          "operation": "create",
          "description": "Create an Admin Settings page that includes a Change Password section (UI + validation + submit) and other admin configuration sections required elsewhere; enforce 'passwordChangeRequired' by redirecting admins here after first login."
        },
        {
          "path": "frontend/src/routes/routeGuards.tsx",
          "operation": "modify",
          "description": "Enhance admin guard logic to enforce first-login password change: if admin profile indicates password change required, redirect to Admin Settings and block other admin pages until completed."
        },
        {
          "path": "frontend/src/components/nav/AdminSidebar.tsx",
          "operation": "create",
          "description": "Add admin sidebar navigation entries including Admin Home, Deposits, Users, Referral Management (if present), Announcements, Audit Logs (UI stub if backend-only), and Settings; ensure Settings remains accessible during password-change enforcement."
        },
        {
          "path": "frontend/src/components/nav/UserSidebar.tsx",
          "operation": "create",
          "description": "Add user sidebar navigation entries including Buy VCoin, Deposit History, Token Balance, Vesting Progress, Referral Earnings, and Referral Network Tree."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add registration UX with anti-duplicate protections: unique email messaging and client fingerprint generation, plus clear errors shown in UI.",
      "acceptanceCriteria": [
        "Attempting to register with an already-used email is blocked with an English message.",
        "Rapid repeated registrations from the same fingerprint are blocked (rate limited).",
        "Registration stores a fingerprint identifier and timestamp(s) used for duplicate detection.",
        "The UI communicates why registration failed (e.g., email already used / too many attempts)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/auth/Register.tsx",
          "operation": "create",
          "description": "Create a registration screen that collects name + email (and optional referral code) and persists the user profile; show clear English error messages for duplicate email and rate limiting returned by the backend."
        },
        {
          "path": "frontend/src/utils/fingerprint.ts",
          "operation": "create",
          "description": "Implement a browser-generated stable fingerprint ID stored in localStorage (no OTP/email). Use this value when saving the user profile to support backend-side anti-duplicate controls."
        },
        {
          "path": "frontend/src/hooks/useRegistration.ts",
          "operation": "create",
          "description": "Add a registration hook that composes fingerprint generation + backend saveCallerUserProfile, handles backend errors, and returns user-friendly English messages."
        },
        {
          "path": "frontend/src/components/feedback/FormError.tsx",
          "operation": "create",
          "description": "Add a small reusable form error/status component to standardize how blocked registration reasons are shown in English (duplicate email, too many attempts, invalid referral code, etc.)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Deliver a consistent, professional UI theme across public site and dashboards with collapsible sidebars for user/admin layouts.",
      "acceptanceCriteria": [
        "User dashboard has a sidebar that can collapse/expand with one click and remains usable on mobile.",
        "Admin dashboard has a sidebar that can collapse/expand with one click and remains usable on mobile.",
        "All pages share a consistent theme (no mismatched styling between sections)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Add global theme variables and base styling (typography, background/foreground, consistent spacing) to support a single coherent visual theme for public + user + admin sections."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust/extend Tailwind theme tokens (colors/typography) as needed to match the VCoin brand and ensure consistent styling across sections."
        },
        {
          "path": "frontend/src/components/layouts/DashboardSidebar.tsx",
          "operation": "create",
          "description": "Create a shared collapsible sidebar component used by both UserDashboardLayout and AdminDashboardLayout with one-click collapse/expand and mobile-friendly behavior."
        },
        {
          "path": "frontend/src/components/layouts/UserDashboardLayout.tsx",
          "operation": "modify",
          "description": "Wire the shared collapsible sidebar into the user layout and ensure responsive behavior."
        },
        {
          "path": "frontend/src/components/layouts/AdminDashboardLayout.tsx",
          "operation": "modify",
          "description": "Wire the shared collapsible sidebar into the admin layout and ensure responsive behavior."
        },
        {
          "path": "frontend/src/components/ui",
          "operation": "modify",
          "description": "Adopt/standardize on shadcn-ui components for forms, dialogs, cards, tables, and buttons to ensure consistent UI patterns. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Build the Buy VCoin page UI with live presale-stage pricing calculations, remaining supply display, and client-side submission blocking when exceeding supply.",
      "acceptanceCriteria": [
        "Admin can set the current stage and/or override price in admin controls; users see the current values on Buy page.",
        "Buy page calculates USDT = VCN quantity × current price and updates live as the user edits quantity.",
        "Approved purchases reduce remaining stage supply; remaining supply is displayed.",
        "System blocks submissions that would exceed remaining supply."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/user/BuyVCoin.tsx",
          "operation": "create",
          "description": "Create the Buy VCoin page that fetches current stage config, shows stage price + remaining supply, calculates USDT amount live from entered VCN quantity, validates against remaining supply, and creates a buy intent before deposit submission."
        },
        {
          "path": "frontend/src/hooks/usePresaleStage.ts",
          "operation": "create",
          "description": "Add a React Query hook to fetch and cache current presale stage (stage, price, remainingSupply) and expose a refetch method for immediate updates after admin changes."
        },
        {
          "path": "frontend/src/hooks/useDepositIntent.ts",
          "operation": "create",
          "description": "Add a hook to create and fetch deposit intents tied to buy calculations (quantity, price, USDT amount, stage) using the backend string-based methods; handle parsing/serialization consistently."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Expose admin-controlled wallet address in UI and always display latest wallet address on Buy page via backend reads/refetch.",
      "acceptanceCriteria": [
        "Admin can update the wallet address in Admin Settings.",
        "Buy page reads the wallet address from backend and displays it.",
        "After admin updates the address, users see the updated address on Buy page after a reload (and during the same session if data is refetched)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useWalletAddress.ts",
          "operation": "create",
          "description": "Add a React Query hook to fetch wallet address from backend and support refetch for same-session updates."
        },
        {
          "path": "frontend/src/pages/user/BuyVCoin.tsx",
          "operation": "modify",
          "description": "Display the latest wallet address from the useWalletAddress hook (no hardcoding) and provide a clear 'copy' affordance with English feedback."
        },
        {
          "path": "frontend/src/pages/admin/AdminSettings.tsx",
          "operation": "modify",
          "description": "Add a Wallet Address section that updates the backend configuration and triggers refetch/invalidation so changes appear after reload and can be refreshed within session."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Implement user deposit submission UI (tx hash + screenshot) with deposit history, and admin review UI for approve/reject with reason and immutable approved records.",
      "acceptanceCriteria": [
        "User can create a deposit record with tx hash + screenshot and see it in Deposit History as Pending.",
        "Admin can view all pending deposits, open details, and Approve or Reject with a reason.",
        "Rejected deposits show the rejection reason to the user in English.",
        "Approved deposits are immutable (cannot be edited by the user)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/user/DepositSubmit.tsx",
          "operation": "create",
          "description": "Create a deposit submission page that ties to a buy intent, collects tx hash + screenshot, validates required fields, submits to backend, and shows success/failure states in English."
        },
        {
          "path": "frontend/src/pages/user/DepositHistory.tsx",
          "operation": "create",
          "description": "Create a deposit history page showing Pending/Approved/Rejected status with timestamps and rejection reason (English) when present; include screenshot thumbnail/preview."
        },
        {
          "path": "frontend/src/pages/admin/DepositsQueue.tsx",
          "operation": "create",
          "description": "Create an admin deposits review screen listing pending submissions; allow opening details with screenshot preview and actions to approve or reject (with required English rejection reason)."
        },
        {
          "path": "frontend/src/hooks/useDeposits.ts",
          "operation": "create",
          "description": "Add hooks to load caller submissions (user) and to load global/pending submissions (admin UI), normalize/parsing the backend string payloads, and expose actions for approve/reject where supported."
        },
        {
          "path": "frontend/src/components/deposits/DepositStatusBadge.tsx",
          "operation": "create",
          "description": "Add a consistent status badge component for Pending/Approved/Rejected states used in user and admin tables."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Show token balances (locked/unlocked) and vesting progress calculations with launch-year (2027) messaging and admin-configurable vesting settings UI.",
      "acceptanceCriteria": [
        "Approving a deposit increases the user’s locked VCN balance by the purchased amount plus any referral bonuses.",
        "Before launch, unlocked balance remains 0 and UI indicates balances are locked until 2027.",
        "Vesting Progress shows a clear English explanation and a month-by-month breakdown (or summary) of unlock amounts once launch is reached/configured.",
        "Admin can configure the launch timestamp/year and vesting parameters used for the schedule calculation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/user/TokenBalance.tsx",
          "operation": "create",
          "description": "Create a user Token Balance page showing Locked vs Unlocked amounts with clear English messaging that tokens remain locked until the configured launch year (default 2027)."
        },
        {
          "path": "frontend/src/pages/user/VestingProgress.tsx",
          "operation": "create",
          "description": "Create a Vesting Progress page that explains vesting in English and shows a month-by-month (or summarized) unlock schedule computed from launch date + parameters; show pre-launch state clearly."
        },
        {
          "path": "frontend/src/utils/vesting.ts",
          "operation": "create",
          "description": "Implement vesting schedule calculation utilities (calculation-only) used by the Vesting Progress page, based on configuration values fetched from backend."
        },
        {
          "path": "frontend/src/pages/admin/AdminSettings.tsx",
          "operation": "modify",
          "description": "Add Launch/Vesting configuration sections that update backend configuration and trigger refetch of user-facing pages after refresh."
        },
        {
          "path": "frontend/src/hooks/useBalancesAndRewards.ts",
          "operation": "create",
          "description": "Add hooks to fetch and aggregate balance/reward-related backend data needed for Token Balance and Vesting Progress pages; include robust parsing + English error states."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Provide user referral UX: referral code/link display, referral earnings breakdown, and registration support for optional referral code input.",
      "acceptanceCriteria": [
        "Each user has a unique referral code and a shareable referral link.",
        "New users can register with an optional referral code; the referral relationship is stored immutably after registration.",
        "When a deposit is approved, referral bonuses are computed and credited as Locked tokens to the appropriate accounts up to 5 levels.",
        "User can view Referral Earnings totals and a per-event breakdown (who/level/amount/date)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/user/ReferralEarnings.tsx",
          "operation": "create",
          "description": "Create a Referral Earnings page showing totals and a per-event breakdown (who/level/amount/date) based on backend data; present all text in clear English."
        },
        {
          "path": "frontend/src/components/referrals/ReferralLinkCard.tsx",
          "operation": "create",
          "description": "Add a component that shows the user's referral code and a shareable referral link with copy-to-clipboard feedback in English."
        },
        {
          "path": "frontend/src/pages/auth/Register.tsx",
          "operation": "modify",
          "description": "Support optional referral code entry (or reading from URL query) and pass it into the saved user profile data submitted during registration."
        },
        {
          "path": "frontend/src/hooks/useReferrals.ts",
          "operation": "create",
          "description": "Add hooks for loading referral summary + earnings breakdown data for the current user and for admin management screens where applicable."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Implement a responsive Referral Network Tree view in the user dashboard up to 5 levels with expansion/pagination for performance.",
      "acceptanceCriteria": [
        "User can open a Referral Network page and see their direct referrals and deeper levels up to level 5.",
        "UI remains responsive for larger trees (uses pagination/expansion rather than rendering everything at once)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/user/ReferralNetworkTree.tsx",
          "operation": "create",
          "description": "Create a Referral Network Tree page with an expandable or paginated tree UI up to level 5; avoid rendering the entire network at once to keep UI responsive."
        },
        {
          "path": "frontend/src/components/referrals/ReferralTree.tsx",
          "operation": "create",
          "description": "Add a reusable tree component with level-based expansion controls and lazy rendering; use consistent cards/typography matching the dashboard theme."
        },
        {
          "path": "frontend/src/hooks/useReferralTree.ts",
          "operation": "create",
          "description": "Create a hook that loads referral tree slices by level/page and provides caching/invalidation; map backend-provided data into a UI-friendly structure."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Build admin dashboard pages for metrics, presale controls, user balance adjustments, referral reward management, and announcement creation/display for users.",
      "acceptanceCriteria": [
        "Admin home shows the requested metrics computed from backend data.",
        "Admin can change stage/price and it affects new buy calculations immediately after refresh.",
        "Admin can credit/debit a user’s locked balance with an audit note and it appears in that user’s history.",
        "Admin can create/edit/disable an announcement; users see active announcements on login/dashboard."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminHome.tsx",
          "operation": "create",
          "description": "Create an admin home dashboard showing total users, tokens sold, USDT collected, current stage, and pending verification count using backend reads; include loading/empty/error states in English."
        },
        {
          "path": "frontend/src/pages/admin/UsersManagement.tsx",
          "operation": "create",
          "description": "Create an admin users management page to view/search users, open user detail, and perform manual token credit/debit (locked) with an audit note field and clear English confirmations."
        },
        {
          "path": "frontend/src/pages/admin/ReferralManagement.tsx",
          "operation": "create",
          "description": "Create an admin referral management page allowing viewing and overriding referral reward entries for a user where backend capabilities exist; show explicit warnings and confirmations."
        },
        {
          "path": "frontend/src/pages/admin/Announcements.tsx",
          "operation": "create",
          "description": "Create an admin announcements page to create/edit/disable announcements; include preview and status (active/disabled)."
        },
        {
          "path": "frontend/src/components/announcements/AnnouncementModal.tsx",
          "operation": "create",
          "description": "Create a user-facing announcement popup component that renders active announcements after login/dashboard load and supports dismissal."
        },
        {
          "path": "frontend/src/hooks/useAdminMetrics.ts",
          "operation": "create",
          "description": "Add a hook to fetch/admin-aggregate dashboard metrics and provide periodic refetch or manual refresh for the admin home screen."
        },
        {
          "path": "frontend/src/pages/user/UserHome.tsx",
          "operation": "create",
          "description": "Create a user dashboard home screen that can show key account info and active announcements on login/dashboard entry."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire new admin and user pages into the router and navigation so none of the screens are orphaned."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Create public informational pages (Whitepaper-style, Smart Contract Architecture info-only, Roadmap 2025–2030) with readable English formatting and navigation links.",
      "acceptanceCriteria": [
        "Public navigation includes pages for Whitepaper, Smart Contract Architecture (informational), and Roadmap.",
        "All content is in English and formatted for readability (sections, headings, lists).",
        "Content clearly states the app is a manual/off-chain presale management website (no on-chain execution)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/public/Whitepaper.tsx",
          "operation": "create",
          "description": "Create a Whitepaper-style overview page with English sections (Vision/Mission, Tokenomics, Presale Stages, Lock/Vesting, Security, Legal/Risk) and clear readability."
        },
        {
          "path": "frontend/src/pages/public/SmartContractArchitecture.tsx",
          "operation": "create",
          "description": "Create an informational Smart Contract Architecture page that explicitly states no on-chain execution is performed and the presale is manually managed/off-chain."
        },
        {
          "path": "frontend/src/pages/public/Roadmap.tsx",
          "operation": "create",
          "description": "Create a Roadmap page covering 2025–2030 with English headings and a readable timeline layout."
        },
        {
          "path": "frontend/src/components/nav/PublicHeader.tsx",
          "operation": "modify",
          "description": "Add navigation links to Whitepaper, Smart Contract Architecture, and Roadmap pages."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register routes for the three public informational pages and ensure they are accessible without authentication."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Implement payment screenshot upload UX with validation, storing stable blob references, and thumbnail preview for user history and admin review.",
      "acceptanceCriteria": [
        "Upload rejects unsupported formats and oversized files with English errors.",
        "User can preview the uploaded screenshot for their deposit record.",
        "Admin can view the screenshot for each pending deposit."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/uploads/ImageUpload.tsx",
          "operation": "create",
          "description": "Create an image upload component for payment screenshots with client-side validation (common image formats, size limit) and English error messages; integrate with blob storage. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/user/DepositSubmit.tsx",
          "operation": "modify",
          "description": "Wire the ImageUpload component into deposit submission, show thumbnail preview before submit, and store the resulting stable asset reference in the submission payload. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/user/DepositHistory.tsx",
          "operation": "modify",
          "description": "Render screenshot thumbnail/preview for each deposit record using the stable blob reference direct URL. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/DepositsQueue.tsx",
          "operation": "modify",
          "description": "Render screenshot preview in admin deposit details using the stable blob reference direct URL. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/uploadValidation.ts",
          "operation": "create",
          "description": "Centralize file validation rules (allowed mime types/extensions and max size) and return consistent English error messages used across upload UIs."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Standardize clear English status/error messaging across all major flows (auth/registration, buy/deposit, balances/vesting, admin actions).",
      "acceptanceCriteria": [
        "All user-visible UI strings are in English.",
        "Major flows (registration, buy/deposit submission, approvals, balances) show clear success/error states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/messages.ts",
          "operation": "create",
          "description": "Add a centralized set of English UI messages and error mappers (including mapping backend trap/error strings into user-friendly explanations) to keep messaging consistent."
        },
        {
          "path": "frontend/src/components/feedback/ToastProvider.tsx",
          "operation": "create",
          "description": "Add an app-wide toast/notification provider for consistent success/error feedback for key actions (registration blocked, deposit submitted, admin changes saved). Use shadcn-ui primitives where available. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the toast provider and ensure all pages use consistent English success/error states rather than raw errors."
        },
        {
          "path": "frontend/src/pages/auth/Register.tsx",
          "operation": "modify",
          "description": "Update registration UI to use standardized English error messages (duplicate email / too many attempts / invalid referral) and show clear success state."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Add generated brand assets (logo, favicon, hero background) and wire them into the UI as static frontend assets.",
      "acceptanceCriteria": [
        "Generated images exist under frontend/public/assets/generated and are used in header/login pages/dashboard.",
        "No image generation is routed through the backend.",
        "Logo appears crisp on light and dark backgrounds."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/vcoin-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated VCoin logo asset at frontend/public/assets/generated/vcoin-logo.dim_512x512.png and ensure it is referenced by UI components as a static asset."
        },
        {
          "path": "frontend/public/assets/generated/vcoin-favicon.dim_64x64.png",
          "operation": "create",
          "description": "Add the generated favicon asset at frontend/public/assets/generated/vcoin-favicon.dim_64x64.png and wire it into the HTML head."
        },
        {
          "path": "frontend/public/assets/generated/vcoin-hero-bg.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated hero background illustration at frontend/public/assets/generated/vcoin-hero-bg.dim_1920x1080.png and use it subtly on public/auth screens."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Wire the favicon by referencing frontend/public/assets/generated/vcoin-favicon.dim_64x64.png in the document head."
        },
        {
          "path": "frontend/src/components/nav/PublicHeader.tsx",
          "operation": "modify",
          "description": "Use frontend/public/assets/generated/vcoin-logo.dim_512x512.png in the public header branding area and ensure it looks crisp on light/dark backgrounds."
        },
        {
          "path": "frontend/src/pages/auth/Login.tsx",
          "operation": "modify",
          "description": "Use frontend/public/assets/generated/vcoin-hero-bg.dim_1920x1080.png as a subtle background and display frontend/public/assets/generated/vcoin-logo.dim_512x512.png on the login screen."
        },
        {
          "path": "frontend/src/components/layouts/UserDashboardLayout.tsx",
          "operation": "modify",
          "description": "Add small brand usage in the dashboard shell (logo in sidebar/header) using frontend/public/assets/generated/vcoin-logo.dim_512x512.png."
        },
        {
          "path": "frontend/src/components/layouts/AdminDashboardLayout.tsx",
          "operation": "modify",
          "description": "Add small brand usage in the dashboard shell (logo in sidebar/header) using frontend/public/assets/generated/vcoin-logo.dim_512x512.png."
        }
      ]
    }
  ]
}