{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix TanStack Router root route rendering and add safe app-level error fallback",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Correct TanStack Router root route so routed content renders (no nested RouterProvider; use Outlet under global wrappers) and RouterProvider is rendered only once in App.",
      "acceptanceCriteria": [
        "Opening the deployed site renders the public home page content instead of a blank screen.",
        "The browser console does not show a runtime error related to accessing `router` before initialization or having nested `RouterProvider` components.",
        "Navigation between public routes (e.g., `/`, `/whitepaper`, `/roadmap`) works and updates the rendered page content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Fix the root route component to render routed content via TanStack Router's Outlet pattern (and keep global wrappers like ThemeProvider and Toaster around it), and remove the nested RouterProvider usage from inside createRootRoute. Ensure RouterProvider is only rendered once at the App component level."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Add an application-level, user-friendly client error fallback to avoid blank screen on unexpected runtime failures during initial render.",
      "acceptanceCriteria": [
        "If a runtime error is thrown during initial render, the UI shows an English error fallback screen instead of rendering nothing.",
        "The fallback screen provides a visible action to recover (at minimum, a “Reload” button that refreshes the page).",
        "In normal operation (no error), the fallback does not appear and the app behaves as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/screens/AppErrorFallback.tsx",
          "operation": "create",
          "description": "Create a minimal, user-friendly fallback screen component that shows a generic English error message (no sensitive details) and a visible recovery action (Reload button that refreshes the page)."
        },
        {
          "path": "frontend/src/components/AppErrorBoundary.tsx",
          "operation": "create",
          "description": "Create a React error boundary component that catches unexpected client runtime errors during app initialization/render and renders AppErrorFallback instead of a blank screen."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the single RouterProvider render in App with the new AppErrorBoundary so unexpected render-time errors display the fallback UI while normal operation remains unchanged."
        }
      ]
    }
  ]
}