{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix blank deployed preview and make routing/assets base-path safe",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Ensure the public Home page renders visible content at `/` in deployed preview (desktop + mobile) and eliminate blank-screen startup scenarios.",
      "acceptanceCriteria": [
        "When opening the deployed preview at `/`, the Public Home page renders visible content (hero section, header, etc.) instead of a blank/black screen.",
        "The fix works on mobile browsers as well as desktop.",
        "If an unexpected runtime error occurs during startup, the user sees an English error fallback screen (not a blank page)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden TanStack Router initialization so `/` reliably resolves to the Public Home route in deployed preview builds; also wire a top-level startup gate so the app always renders a visible screen before the first route paints. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/StartupGate.tsx",
          "operation": "create",
          "description": "Create a small top-level wrapper that guarantees something visible is rendered immediately (startup loading state) and that can switch to an English error state if startup cannot proceed, without exposing sensitive technical details. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/screens/StartupStatusScreen.tsx",
          "operation": "create",
          "description": "Create a full-page, mobile-friendly status UI used by StartupGate (Loading + Error variants) with an English message and a 'Reload' action. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppErrorBoundary.tsx",
          "operation": "modify",
          "description": "Ensure the error boundary fallback remains user-visible and is used for unexpected runtime errors during startup (no blank screen). Keep user-facing messaging in English and do not display stack traces or internal IDs. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal global resilience styles to reduce chances of an all-black/blank viewport on mobile (e.g., ensure html/body/#root take full height and keep background/text colors applied consistently). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Make deployed preview base-path safe so router matching and static assets load correctly under non-root subpaths.",
      "acceptanceCriteria": [
        "In production/deployed preview, the HTML entry point references the favicon and the main script in a way that works under non-root base paths (no broken asset/script URLs).",
        "TanStack Router correctly matches `/` to the public Home route in the deployed preview environment (no blank screen due to route mismatch).",
        "Static generated assets referenced via `assetUrl(...)` (e.g., `assets/generated/vcoin-hero-bg.dim_1920x1080.png` and `assets/generated/vcoin-logo.dim_512x512.png`) load successfully in deployed preview (no missing-image failures that prevent rendering)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the HTML entry to be base-path safe for preview URLs: ensure favicon reference works under subpaths by wiring it via the correct base handling, and ensure the main module script reference is also base-path safe. Must reference the generated favicon at frontend/public/assets/generated/vcoin-favicon.dim_64x64.png. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Normalize and apply the correct base path when creating the TanStack Router so deployed previews hosted under a subpath still match `/` to the public home route tree. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/assetUrl.ts",
          "operation": "modify",
          "description": "Harden `assetUrl(...)` so it reliably generates production-safe URLs under non-root base paths without producing double slashes or incorrect absolute paths; ensure it continues to work for generated assets like frontend/public/assets/generated/vcoin-hero-bg.dim_1920x1080.png and frontend/public/assets/generated/vcoin-logo.dim_512x512.png. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/public/Home.tsx",
          "operation": "modify",
          "description": "Validate that the Home hero background and logo use `assetUrl(...)` correctly so deployed preview subpaths load frontend/public/assets/generated/vcoin-hero-bg.dim_1920x1080.png and frontend/public/assets/generated/vcoin-logo.dim_512x512.png without missing-asset render failures. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/nav/PublicHeader.tsx",
          "operation": "modify",
          "description": "Validate the header logo uses `assetUrl(...)` correctly so the generated logo at frontend/public/assets/generated/vcoin-logo.dim_512x512.png loads under subpath deployments. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add a guaranteed English startup loading/error UI so users never see a blank screen during initialization or unexpected startup failure.",
      "acceptanceCriteria": [
        "If the app is initializing (before routes render), a visible full-page loading or status UI is shown.",
        "If startup fails in a way not caught by existing guards, a visible English error UI with a 'Reload' action is shown instead of a blank screen.",
        "No sensitive details (stack traces, internal IDs) are displayed to end users in these states."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StartupGate.tsx",
          "operation": "create",
          "description": "Implement a global startup state controller that shows an immediate full-page loading UI, then renders the app routes; if a startup failure is detected (e.g., unexpected initialization error), switch to a generic English error UI with a Reload action and no sensitive details. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/screens/StartupStatusScreen.tsx",
          "operation": "create",
          "description": "Implement the user-visible English Loading/Error screen used by StartupGate, including a 'Reload' action that refreshes the page, ensuring the UI is visible on mobile and desktop. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire StartupGate into the top-level app composition (above the routed content) so a visible status screen is always shown during initialization and cannot result in a blank page. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/routes/routeGuards.tsx",
          "operation": "modify",
          "description": "Adjust guard behavior to avoid returning `null` in any transitional auth/routing state that could produce a blank screen; ensure any temporary state renders a visible English loading/status UI (without exposing sensitive details). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}